PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_cec.c
/*!
    \file    gd32f3x0_hal_cec.c
    \brief   CEC driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifdef GD32F350
#include "gd32f3x0_hal.h"

/* CEC handler in transmit mode */
static void _cec_transmit_interrupt(void *cec);
/* CEC handler in receive mode */
static void _cec_receive_interrupt(void *cec);
/* CEC enable interrupt */
static void _cec_interrupt_enable(uint32_t flag);
/* CEC disable interrupt */
static void _cec_interrupt_disable(uint32_t flag);
/* CEC get int flag and status */
static FlagStatus _cec_interrupt_flag_get(uint32_t flag);
/* CEC clear int flag and status */
static void _cec_interrupt_flag_clear(uint32_t flag);

/*!
    \brief      initialize the CEC structure with the default values
    \param[in]  hal_struct_type: the argument could be selected from enumeration <hal_cec_struct_type_enum>
    \param[in]  p_struct: pointer to CEC structure that contains the configuration information
    \param[out] none
    \retval     none
*/
void hal_cec_struct_init(hal_cec_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == p_struct) {
        HAL_DEBUGE("pointer [*p_struct] value is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    switch(hal_struct_type) {
    case HAL_CEC_INIT_STRUCT:
        /* initialize CEC initialization structure with the default values */
        ((hal_cec_init_struct *)p_struct)->signal_free_time                        = CEC_SFT_PROTOCOL_PERIOD;
        ((hal_cec_init_struct *)p_struct)->reception_bit_timing_tolerance          = CEC_STANTARD_RTOL;
        ((hal_cec_init_struct *)p_struct)->sft_start_option_bit                    = CEC_SFT_START_STAOM;
        ((hal_cec_init_struct *)p_struct)->listen_mode                             = CEC_PARTIAL_LISTENING_MODE;
        ((hal_cec_init_struct *)p_struct)->own_address                             = CEC_OWN_ADDRESS0;
        ((hal_cec_init_struct *)p_struct)->bre_stop_receive                        = CEC_NOT_STOP_RECEPTION;
        ((hal_cec_init_struct *)p_struct)->bre_generate_error                      = CEC_NO_RISING_PERIOD_ERROR;
        ((hal_cec_init_struct *)p_struct)->blpe_generate_error                     = CEC_NO_LONG_PERIOD_ERROR;
        ((hal_cec_init_struct *)p_struct)->not_generate_error_broadcast            = CEC_GEN_BROADCAST_ERROR;
        break;
    case HAL_CEC_IRQ_STRUCT:
        /* initialize CEC IRQ structure with the default values */
        ((hal_cec_irq_struct *)p_struct)->cec_tx_handle                            = NULL;
        ((hal_cec_irq_struct *)p_struct)->cec_rx_handle                            = NULL;
        break;
    case HAL_CEC_DEV_STRUCT:
        /* initialize CEC device structure with the default values */
        ((hal_cec_dev_struct *)p_struct)->cec_irq.cec_tx_handle                    = NULL;
        ((hal_cec_dev_struct *)p_struct)->cec_irq.cec_rx_handle                    = NULL;
        ((hal_cec_dev_struct *)p_struct)->state                                    = HAL_CEC_STATE_NONE;
        ((hal_cec_dev_struct *)p_struct)->tx_buffer                                = NULL;
        ((hal_cec_dev_struct *)p_struct)->tx_count                                 = 0;
        ((hal_cec_dev_struct *)p_struct)->rx_buffer                                = NULL;
        ((hal_cec_dev_struct *)p_struct)->rx_count                                 = 0;
        ((hal_cec_dev_struct *)p_struct)->rx_buffer                                = NULL;
        ((hal_cec_dev_struct *)p_struct)->tx_callback                              = NULL;
        ((hal_cec_dev_struct *)p_struct)->rx_callback                              = NULL;
        ((hal_cec_dev_struct *)p_struct)->err_callback                             = NULL;
        ((hal_cec_dev_struct *)p_struct)->mutex                                    = HAL_MUTEX_UNLOCKED;
        ((hal_cec_dev_struct *)p_struct)->priv                                     = NULL;
        break;
    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      initialize CEC
    \param[in]  cec_dev: CEC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  cec: the pointer of CEC init structure
                  signal_free_time:
                  only one parameter can be selected which is shown as below:
      \arg          CEC_SFT_PROTOCOL_PERIOD: the signal free time will perform as HDMI-CEC protocol description
      \arg          CEC_SFT_1POINT5_PERIOD: 1.5 nominal data bit periods
      \arg          CEC_SFT_2POINT5_PERIOD: 2.5 nominal data bit periods
      \arg          CEC_SFT_3POINT5_PERIOD: 3.5 nominal data bit periods
      \arg          CEC_SFT_4POINT5_PERIOD: 4.5 nominal data bit periods
      \arg          CEC_SFT_5POINT5_PERIOD: 5.5 nominal data bit periods
      \arg          CEC_SFT_6POINT5_PERIOD: 6.5 nominal data bit periods
      \arg          CEC_SFT_7POINT5_PERIOD: 7.5 nominal data bit periods
                  reception_bit_timing_tolerance:
                  only one parameter can be selected which is shown as below:
      \arg          CEC_STANTARD_RTOL: Extended bit timing tolerance
      \arg          CEC_EXTENDED_RTOL: Standard bit timing tolerance
                  sft_start_option_bit:
                  only one parameter can be selected which is shown as below:
      \arg          CEC_SFT_START_STAOM: signal free time counter starts counting when STAOM is asserted
      \arg          CEC_SFT_START_LAST: signal free time counter starts automatically after transmission/reception end
                  listen_mode:
                  only one parameter can be selected which is shown as below:
      \arg          CEC_PARTIAL_LISTENING_MODE: Only receive broadcast and singlecast in OAD address with appropriate ACK
      \arg          CEC_WHOLE_LISTENING_MODE: Receive broadcast and singlecast in OAD address with appropriate ACK and receive
                                              message whose destination address is not in OAD without feedback ACK
                  address:
                  only one parameter can be selected which is shown as below:
      \arg          CEC_OWN_ADDRESS0: own address is 0
      \arg          CEC_OWN_ADDRESS1: own address is 1
      \arg          CEC_OWN_ADDRESS2: own address is 2
      \arg          CEC_OWN_ADDRESS3: own address is 3
      \arg          CEC_OWN_ADDRESS4: own address is 4
      \arg          CEC_OWN_ADDRESS5: own address is 5
      \arg          CEC_OWN_ADDRESS6: own address is 6
      \arg          CEC_OWN_ADDRESS7: own address is 7
      \arg          CEC_OWN_ADDRESS8: own address is 8
      \arg          CEC_OWN_ADDRESS9: own address is 9
      \arg          CEC_OWN_ADDRESS10: own address is 10
      \arg          CEC_OWN_ADDRESS11: own address is 11
      \arg          CEC_OWN_ADDRESS12: own address is 12
      \arg          CEC_OWN_ADDRESS13: own address is 13
      \arg          CEC_OWN_ADDRESS14: own address is 14
                  bre_stop_receive:
                  only one parameter can be selected which is shown as below:
      \arg          CEC_NOT_STOP_RECEPTION: do not stop reception when detected bit rising error
      \arg          CEC_STOP_RECEPTION: stop reception when detected bit rising error
                  bre_generate_error:
                  only one parameter can be selected which is shown as below:
      \arg          CEC_NO_RISING_PERIOD_ERROR: do not generate Error-bit on bit rising error
      \arg          CEC_GEN_RISING_PERIOD_ERROR: generate Error-bit on bit rising error
                  blpe_generate_error:
                  only one parameter can be selected which is shown as below:
      \arg          CEC_NO_LONG_PERIOD_ERROR: do not generate Error-bit on long bit period error
      \arg          CEC_GEN_LONG_PERIOD_ERROR: generate Error-bit on long bit period error
                  not_generate_error_broadcast:
                  only one parameter can be selected which is shown as below:
      \arg          CEC_GEN_BROADCAST_ERROR: generate Error-bit in broadcast
      \arg          CEC_NO_BROADCAST_ERROR: do not generate Error-bit in broadcast
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_cec_init(hal_cec_dev_struct *cec_dev, hal_cec_init_struct *cec)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == cec_dev) || (NULL == cec)) {
        HAL_DEBUGE("pointer [*cec_dev] or pointer [*cec] address is invalid");
        /* return function state */
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    cec_dev->state = HAL_CEC_STATE_BUSY;

    /* disable cec */
    CEC_CTL &= ~CEC_CTL_CECEN;
    /* configure cec */
    CEC_CFG = cec->blpe_generate_error | cec->bre_generate_error | cec->bre_stop_receive |  \
              cec->listen_mode | cec->not_generate_error_broadcast | cec->own_address |     \
              cec->reception_bit_timing_tolerance | cec->sft_start_option_bit | cec->signal_free_time;

    /* change CEC error state */
    cec_dev->error_state = HAL_CEC_ERROR_NONE;
    /* change CEC state */
    cec_dev->state = HAL_CEC_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}


/*!
    \brief      deinitialize CEC device structure
    \param[in]  cec_dev: CEC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_cec_deinit(hal_cec_dev_struct *cec_dev)
{

