PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_cec.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == cec_dev) {
        HAL_DEBUGE("pointer [cec_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* deactivate CEC interrupts associated to the set of TX and RX flags */
    _cec_interrupt_disable(CEC_INTEN_RENDIE | CEC_INTEN_BRIE | CEC_INTEN_TENDIE | CEC_INTEN_TBRIE);

    /* deactivate CEC interrupts associated to the set of TX and RX error */
    _cec_interrupt_disable(CEC_INTEN_ROIE | CEC_INTEN_BREIE | CEC_INTEN_BPSEIE | \
                           CEC_INTEN_BPLEIE | CEC_INTEN_RAEIE | CEC_INTEN_ARBFIE | \
                           CEC_INTEN_TUIE | CEC_INTEN_TERRIE | CEC_INTEN_TAERRIE);

    cec_dev->state = HAL_CEC_STATE_BUSY;

    /* change CEC error state and state */
    cec_dev->error_state = HAL_CEC_ERROR_NONE;
    cec_dev->state = HAL_CEC_STATE_RESET;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      start CEC module function
    \param[in]  cec_dev: CEC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_cec_start(hal_cec_dev_struct *cec_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == cec_dev) {
        HAL_DEBUGE("pointer [cec_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    cec_dev->state = HAL_CEC_STATE_BUSY;

    /* enable cec */
    CEC_CTL |= CEC_CTL_CECEN;

    cec_dev->state = HAL_CEC_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      stop CEC module function
    \param[in]  cec_dev: CEC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_cec_stop(hal_cec_dev_struct *cec_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == cec_dev) {
        HAL_DEBUGE("pointer [cec_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* disable cec */
    CEC_CTL &= ~CEC_CTL_CECEN;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by interrupt method
    \param[in]  cec_dev: CEC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  tx_length: length of data to be sent
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  header_addr: header address
    \param[in]  destination_addr: destination address
    \param[in]  p_func: CEC transmit interrupt callback function structure
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_cec_transmit_interrupt(hal_cec_dev_struct *cec_dev, uint32_t tx_length, uint8_t *p_buffer, \
                                   uint8_t header_addr, uint8_t destination_addr, hal_cec_user_cb p_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == cec_dev)) {
        HAL_DEBUGE("pointer [cec_dev] or pointer [p_irq] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    if(cec_dev->state == HAL_CEC_STATE_READY) {
        /* lock CEC */
        HAL_LOCK(cec_dev);

        /* disable cec */
        CEC_CTL &= ~CEC_CTL_CECEN;

        cec_dev->tx_count = tx_length;

        cec_dev->tx_buffer = p_buffer;

        cec_dev->state = HAL_CEC_STATE_BUSY;
        cec_dev->cec_irq.cec_tx_handle = _cec_transmit_interrupt;

        cec_dev->tx_callback = p_func;

        /* clear the specified CEC interrupt flag */
        _cec_interrupt_flag_clear(CEC_INT_FLAG_TEND | CEC_INT_FLAG_TBR);
        /* activate CEC interrupts associated to the set of TX and RX flags */
        _cec_interrupt_enable(CEC_INTEN_TENDIE | CEC_INTEN_TBRIE);

        /* enable cec */
        CEC_CTL |= CEC_CTL_CECEN;


        /* (length = 0) Set TX End of Message (ENDOM) bit, must be set before writing data to TDATA */
        if(tx_length == 0U) {
            CEC_CTL |= CEC_CTL_ENDOM;
        }

        /* send header block */
        CEC_TDATA = ((uint8_t)(header_addr << CEC_HEADER_ADDR_POS) | (uint8_t) destination_addr);
        /* Set TX Start of Message (STAOM) bit */
        CEC_CTL |= CEC_CTL_STAOM;

        /* unlock CEC */
        HAL_UNLOCK(cec_dev);
    }

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by interrupt method
    \param[in]  cec_dev: CEC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  p_func: CEC transmit interrupt callback function structure
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_cec_receive_interrupt(hal_cec_dev_struct *cec_dev, uint8_t *p_buffer, hal_cec_user_cb p_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == cec_dev)) {
        HAL_DEBUGE("pointer [cec_dev] or pointer [p_irq] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    if(cec_dev->state == HAL_CEC_STATE_READY) {
        /* lock CEC */
        HAL_LOCK(cec_dev);

        cec_dev->state = HAL_CEC_STATE_BUSY;
        cec_dev->cec_irq.cec_rx_handle = _cec_receive_interrupt;

        cec_dev->rx_callback = p_func;

        cec_dev->rx_buffer = p_buffer;

        _cec_interrupt_flag_clear(CEC_INT_FLAG_BR | CEC_INT_FLAG_REND | CEC_INT_FLAG_ARBF | \
                                  CEC_INT_FLAG_TU | CEC_INT_FLAG_TERR | CEC_INT_FLAG_TAERR | \
                                  CEC_INT_FLAG_RO | CEC_INT_FLAG_BRE | CEC_INT_FLAG_BPSE | \
                                  CEC_INT_FLAG_BPLE | CEC_INT_FLAG_RAE);

