PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_cec.c
        /* activate CEC interrupts associated to the set of RX flags */
        _cec_interrupt_enable(CEC_INTEN_RENDIE | CEC_INTEN_BRIE);

        /* activate CEC interrupts associated to the set of TX and RX error */
        _cec_interrupt_enable(CEC_INTEN_ROIE | CEC_INTEN_BREIE | CEC_INTEN_BPSEIE | \
                              CEC_INTEN_BPLEIE | CEC_INTEN_RAEIE | CEC_INTEN_ARBFIE | \
                              CEC_INTEN_TUIE | CEC_INTEN_TERRIE | CEC_INTEN_TAERRIE);

        /* unlock CEC */
        HAL_UNLOCK(cec_dev);
    }

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      set user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  cec_dev: CEC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to CEC interrupt callback functions structure
                  The structure member can be assigned as following parameters:
      \arg        hal_irq_handle_cb: the function is user-defined, the corresponding callback
                    mechanism is in use, and enable corresponding interrupt
      \arg        NULL: The corresponding callback mechanism is out of use, and disable
                    corresponding interrupt
    \param[out] none
    \retval     none
*/
void hal_cec_irq_handle_set(hal_cec_dev_struct *cec_dev, hal_cec_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == cec_dev) || (NULL == p_irq)) {
        HAL_DEBUGE("pointer [cec_dev] or pointer [p_irq] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* CEC tx interrupt handler set */
    if(NULL != p_irq->cec_tx_handle) {
        cec_dev->cec_irq.cec_tx_handle = p_irq->cec_tx_handle;
        _cec_interrupt_enable(CEC_INTEN_TENDIE | CEC_INTEN_TBRIE);
    } else {
        cec_dev->cec_irq.cec_tx_handle = NULL;
        _cec_interrupt_disable(CEC_INTEN_TENDIE | CEC_INTEN_TBRIE);
    }

    /* CEC rx interrupt handler set */
    if(NULL != p_irq->cec_rx_handle) {
        cec_dev->cec_irq.cec_rx_handle = p_irq->cec_rx_handle;
        _cec_interrupt_enable(CEC_INTEN_RENDIE | CEC_INTEN_BRIE);
    } else {
        cec_dev->cec_irq.cec_rx_handle = NULL;
        _cec_interrupt_disable(CEC_INTEN_RENDIE | CEC_INTEN_BRIE);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  cec_dev: CEC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_cec_irq_handle_all_reset(hal_cec_dev_struct *cec_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == cec_dev) {
        HAL_DEBUGE("pointer [cec_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* CEC interrupt handler reset */
    cec_dev->cec_irq.cec_tx_handle = NULL;
    cec_dev->cec_irq.cec_rx_handle = NULL;
}

/*!
    \brief      CEC interrupt handler content function, which is merely used in cec_handler
    \param[in]  cec_dev: CEC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_cec_irq(hal_cec_dev_struct *cec_dev)
{
    hal_cec_dev_struct *p_cec = cec_dev;
    hal_cec_user_cb perr_func = (hal_cec_user_cb)p_cec->err_callback;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == cec_dev) {
        HAL_DEBUGE("pointer [cec_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* check if a reception error occured */
    if(_cec_interrupt_flag_get(CEC_INT_FLAG_RO)) {
        _cec_interrupt_flag_clear(CEC_INT_FLAG_RO);
        p_cec->error_state = HAL_CEC_ERROR_RO;
        p_cec->state = HAL_CEC_STATE_READY;
        p_cec->rx_count = 0U;
    }

    /* check if a bit rising error occured */
    if(_cec_interrupt_flag_get(CEC_INT_FLAG_BRE)) {
        _cec_interrupt_flag_clear(CEC_INT_FLAG_BRE);
        p_cec->error_state = HAL_CEC_ERROR_BRE;
        p_cec->state = HAL_CEC_STATE_READY;
        p_cec->rx_count = 0U;
    }

    /* check if a short bit period error occured */
    if(_cec_interrupt_flag_get(CEC_INT_FLAG_BPSE)) {
        _cec_interrupt_flag_clear(CEC_INT_FLAG_BPSE);
        p_cec->error_state = HAL_CEC_ERROR_BPSE;
        p_cec->state = HAL_CEC_STATE_READY;
        p_cec->rx_count = 0U;
    }

    /* check if a long bit period error occured */
    if(_cec_interrupt_flag_get(CEC_INT_FLAG_BPLE)) {
        _cec_interrupt_flag_clear(CEC_INT_FLAG_BPLE);
        p_cec->error_state = HAL_CEC_ERROR_BPLE;
        p_cec->state = HAL_CEC_STATE_READY;
        p_cec->rx_count = 0U;
    }

    /* check if a Rx ACK error occured */
    if(_cec_interrupt_flag_get(CEC_INT_FLAG_RAE)) {
        _cec_interrupt_flag_clear(CEC_INT_FLAG_RAE);
        p_cec->error_state = HAL_CEC_ERROR_RAE;
        p_cec->state = HAL_CEC_STATE_READY;
        p_cec->rx_count = 0U;
    }

    /* check if a arbitration fail error occurred */
    if(_cec_interrupt_flag_get(CEC_INT_FLAG_ARBF)) {
        _cec_interrupt_flag_clear(CEC_INT_FLAG_ARBF);
        p_cec->error_state = HAL_CEC_ERROR_ARBF;
    } else {
        /* check if a Tx data buffer underrun error occurred */
        if(_cec_interrupt_flag_get(CEC_INT_FLAG_TU)) {
            _cec_interrupt_flag_clear(CEC_INT_FLAG_TU);
            p_cec->error_state = HAL_CEC_ERROR_TU;
        }

        /* check if a Tx error occurred */
        if(_cec_interrupt_flag_get(CEC_INT_FLAG_TERR)) {
            _cec_interrupt_flag_clear(CEC_INT_FLAG_TERR);
            p_cec->error_state = HAL_CEC_ERROR_TERR;
        }

        /* check if a Tx ACK error occurred */
        if(_cec_interrupt_flag_get(CEC_INT_FLAG_TAERR)) {
            _cec_interrupt_flag_clear(CEC_INT_FLAG_TAERR);
            p_cec->error_state = HAL_CEC_ERROR_TAERR;
            p_cec->rx_count = 0U;
        }

