PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_cec.c
        p_cec->state = HAL_CEC_STATE_READY;
    }

    if(cec_dev->cec_irq.cec_rx_handle != NULL) {
        cec_dev->cec_irq.cec_rx_handle(cec_dev);
    }

    if(cec_dev->cec_irq.cec_tx_handle != NULL) {
        cec_dev->cec_irq.cec_tx_handle(cec_dev);
    }

    if(p_cec->error_state != HAL_CEC_ERROR_NONE) {
        if(NULL != perr_func) {
            perr_func(p_cec);
        }
    }
}

/*!
    \brief      handler in CEC transmit mode
    \param[in]  cec: CEC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _cec_transmit_interrupt(void *cec)
{
    static uint8_t send_inc = 0U;
    uint32_t length = 0;

    hal_cec_dev_struct *p_cec = cec;
    hal_cec_user_cb ptx_func = (hal_cec_user_cb)p_cec->tx_callback;

    length = p_cec->tx_count;

    /* check if end of message bit is set in the data to be transmitted */
    if(_cec_interrupt_flag_get(CEC_INT_FLAG_TEND)) {
        _cec_interrupt_flag_clear(CEC_INT_FLAG_TEND | CEC_INT_FLAG_TBR);
        p_cec->state = HAL_CEC_STATE_READY;
        p_cec->error_state = HAL_CEC_ERROR_NONE;
        send_inc = 0U;

        if(NULL != ptx_func) {
            ptx_func(p_cec);
        }
    } else if(_cec_interrupt_flag_get(CEC_INT_FLAG_TBR)) {
        /* set EOM bit if the byte to be transmitted is the last one of the senddata */
        if(send_inc++ == (length - 1U)) {
            CEC_CTL |= CEC_CTL_ENDOM;
            CEC_TDATA = (*p_cec->tx_buffer++);
        } else {
            /* send the byte in the transdata */
            CEC_TDATA = (*p_cec->tx_buffer++);
        }
        p_cec->state = HAL_CEC_STATE_BUSY_TX;
        _cec_interrupt_flag_clear(CEC_INT_FLAG_TBR);
    }
}

/*!
    \brief      handler in CEC receive mode
    \param[in]  cec: CEC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _cec_receive_interrupt(void *cec)
{
    hal_cec_dev_struct *p_cec = cec;
    hal_cec_user_cb prx_func = (hal_cec_user_cb)p_cec->rx_callback;

    /* receive data */
    if(_cec_interrupt_flag_get(CEC_INT_FLAG_BR)) {
        p_cec->state = HAL_CEC_STATE_BUSY_RX;
        p_cec->rx_buffer[p_cec->rx_count] = (uint8_t)CEC_RDATA;
        p_cec->rx_count++;
        _cec_interrupt_flag_clear(CEC_INT_FLAG_BR);
    }
    /* check if the byte received is the last one of the message */
    if(_cec_interrupt_flag_get(CEC_INT_FLAG_REND)) {
        p_cec->state = HAL_CEC_STATE_READY;
        p_cec->error_state = HAL_CEC_ERROR_NONE;
        p_cec->rx_count = 0U;
        _cec_interrupt_flag_clear(CEC_INT_FLAG_REND);

        if(NULL != prx_func) {
            prx_func(p_cec);
        }
    }
}

/*!
    \brief      enable interrupt
    \param[in]  flag: specify which flag
                one or more parameters can be selected which are shown as below:
      \arg        CEC_INT_BR: enable Rx-byte data received interrupt
      \arg        CEC_INT_REND: enable end of reception interrupt
      \arg        CEC_INT_RO: enable RX overrun interrupt
      \arg        CEC_INT_BRE: enable bit rising error interrupt
      \arg        CEC_INT_BPSE: enable short bit period error interrupt
      \arg        CEC_INT_BPLE: enable long bit period error interrupt
      \arg        CEC_INT_RAE: enable Rx ACK error interrupt
      \arg        CEC_INT_ARBF: enable arbitration lost interrupt
      \arg        CEC_INT_TBR: enable Tx-byte data request interrupt
      \arg        CEC_INT_TEND: enable transmission successfully end interrupt
      \arg        CEC_INT_TU: enable Tx data buffer underrun interrupt
      \arg        CEC_INT_TERR: enable Tx-error interrupt
      \arg        CEC_INT_TAERR: enable Tx ACK error interrupt
    \param[out] none
    \retval     none
*/
static void _cec_interrupt_enable(uint32_t flag)
{
    CEC_INTEN |= flag;
}

/*!
    \brief      disable interrupt
    \param[in]  flag: specify which flag
                one or more parameters can be selected which are shown as below:
      \arg        CEC_INT_BR: disable Rx-byte data received interrupt
      \arg        CEC_INT_REND: disable end of reception interrupt
      \arg        CEC_INT_RO: disable RX overrun interrupt
      \arg        CEC_INT_BRE: disable bit rising error interrupt
      \arg        CEC_INT_BPSE: disable short bit period error interrupt
      \arg        CEC_INT_BPLE: disable long bit period error interrupt
      \arg        CEC_INT_RAE: disable Rx ACK error interrupt
      \arg        CEC_INT_ARBF: disable arbitration lost interrupt
      \arg        CEC_INT_TBR: disable Tx-byte data request interrupt
      \arg        CEC_INT_TEND: disable transmission successfully end interrupt
      \arg        CEC_INT_TU: disable Tx data buffer underrun interrupt
      \arg        CEC_INT_TERR: disable Tx-error interrupt
      \arg        CEC_INT_TAERR: disable Tx ACK error  interrupt

    \param[out] none
    \retval     none
*/
static void _cec_interrupt_disable(uint32_t flag)
{
    CEC_INTEN &= ~flag;
}

/*!
    \brief      get CEC int flag and status
    \param[in]  flag:  specify which flag
                one or more parameters can be selected which are shown as below:
      \arg        CEC_INT_FLAG_BR: Rx-byte data received
      \arg        CEC_INT_FLAG_REND: end of reception
      \arg        CEC_INT_FLAG_RO: RX overrun
      \arg        CEC_INT_FLAG_BRE: bit rising error
      \arg        CEC_INT_FLAG_BPSE: short bit period error
      \arg        CEC_INT_FLAG_BPLE: long bit period error
      \arg        CEC_INT_FLAG_RAE: Rx ACK error
      \arg        CEC_INT_FLAG_ARBF: arbitration lost
      \arg        CEC_INT_FLAG_TBR: Tx-byte data request
      \arg        CEC_INT_FLAG_TEND: transmission successfully end
      \arg        CEC_INT_FLAG_TU: Tx data buffer underrun
      \arg        CEC_INT_FLAG_TERR: Tx-error
      \arg        CEC_INT_FLAG_TAERR: Tx ACK error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
static FlagStatus _cec_interrupt_flag_get(uint32_t flag)
{
    uint32_t interrupt_enable = 0U, interrupt_flag = 0U;
    interrupt_flag = (CEC_INTF & flag);
    interrupt_enable = (CEC_INTEN & flag);
    if(interrupt_flag && interrupt_enable) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear CEC int flag and status
    \param[in]  flag:  specify which flag
                one or more parameters can be selected which are shown as below:
      \arg        CEC_INT_FLAG_BR: Rx-byte data received
      \arg        CEC_INT_FLAG_REND: end of reception
      \arg        CEC_INT_FLAG_RO: RX overrun
      \arg        CEC_INT_FLAG_BRE: bit rising error
      \arg        CEC_INT_FLAG_BPSE: short bit period error
      \arg        CEC_INT_FLAG_BPLE: long bit period error
      \arg        CEC_INT_FLAG_RAE: Rx ACK error
      \arg        CEC_INT_FLAG_ARBF: arbitration lost
      \arg        CEC_INT_FLAG_TBR: Tx-byte data request
      \arg        CEC_INT_FLAG_TEND: transmission successfully end
      \arg        CEC_INT_FLAG_TU: Tx data buffer underrun
      \arg        CEC_INT_FLAG_TERR: Tx-error
      \arg        CEC_INT_FLAG_TAERR: Tx ACK error flag
    \param[out] none
    \retval     none
*/
static void _cec_interrupt_flag_clear(uint32_t flag)
{
    CEC_INTF = flag;
}

#endif /* GD32F350 */
